Repository: jamf/NoMAD
Catalog: NoMAD/*.lproj/MainMenu.strings
Languages: hr_ba, nn, ru

# 0IM-ZO-KLA.ibShadowedToolTip
source: Change your network password.
hr_ba: Promijenite svoju mrežnu šifru.
nn: Endre passord.
ru: Сменить пароль сетевой учетной записи.

# 0IM-ZO-KLA.title
source: Change Password
hr_ba: Promijeni šifru
nn: Endre Passord
ru: Сменить пароль

# 3Pf-2O-qR7.ibShadowedToolTip
source: Lock your screen.
hr_ba: Zaključaj svoj ekran.
nn: Lås skjerm.
ru: Заблокировать экран.

# 3Pf-2O-qR7.title
source: Lock Screen
hr_ba: Zaključaj ekran
nn: Lås skjerm
ru: Заблокировать экран

# 3yQ-ft-CVW.title
source: Preferences
hr_ba: Postavci
nn: Instillinger
ru: Настройки

# A9U-v2-LiT.ibShadowedToolTip
source: Certificate expiration date.
hr_ba: Datum isteka certifikata.
nn: Sertifikatutløpsdato.
ru: Дата окончания действия сертификата.

# A9U-v2-LiT.title
source: CertificateDate
hr_ba: Datum certifikata
nn: SertifikatDato

# AlW-9M-CK2.ibShadowedToolTip
source: Get a certificate.
hr_ba: Primi certifikat.
nn: Hent et sertifikat.

# AlW-9M-CK2.title
source: Get Certificate
hr_ba: Primi certifikat
nn: Hent et sertifikat

# CUr-ED-n29.ibShadowedToolTip
source: Time until your network password expires.
hr_ba: Vrijeme do isteka vaše mrežne šifre.
nn: Gjenstående tid før passord utgår.

# CUr-ED-n29.title
source: password expires
hr_ba: Šifra istiće
nn: passordet utløper
ru: пароль истекает

# QYf-mL-9ta.ibShadowedToolTip
source: Time until your Kerberos ticket expires.
hr_ba: Vrijeme do isteka vašeg Kerber tiketa.
nn: Gjenstående tid til Kerberos-billett utløper.
ru: Время до окончания срока действия тикета Kerberos.

# QYf-mL-9ta.title
source: ticket life
hr_ba: vijek tiketa
nn: billetliv
ru: время жизни тикета

# Wa6-S1-lXm.ibShadowedToolTip
source: Sign in with your network account.
hr_ba: Prijavi se sa mrežnim korisnikom.
nn: Logg inn med din nettverkskonto.
ru: Войти через сетевую учетную запись.

# Wa6-S1-lXm.title
source: Sign In
hr_ba: Prijavi se
nn: Logg Inn
ru: Войти

# XL2-b8-IwM.ibShadowedToolTip
source: Sign in with your network account.
hr_ba: Prijavi se sa mrežnim korisnikom.
nn: Logg inn med din nettverkskonto.
ru: Войти через сетевую учетную запись.

# XL2-b8-IwM.title
source: Log In 2
hr_ba: Prijava 2
nn: Logg Inn 2
ru: Вход 2

# fuo-5h-NuR.title
source: Get Software
hr_ba: Skini softver
nn: Hent Programvare
ru: Загрузить ПО

# gM7-FQ-f0l.title
source: Quit
hr_ba: Prekini
nn: Avslutt
ru: Выйти из программы

# kql-Bl-QJE.title
source: Hidden Item 1
hr_ba: Skriveni predmet 1
nn: Skjult gjenstand 1
ru: Скрытый элемент 1

# pC8-5a-Aec.title
source: Dump Logs
hr_ba: Logovi
nn: Dump Logger

# rbx-v6-fJx.title
source: Get Help
hr_ba: Pomoć
nn: Få Hjelp
ru: Связаться с поддержкой

# uQI-ol-UUw.ibShadowedToolTip
source: Your network user name.
hr_ba: Vaše mrežno korisničko ime.
nn: Ditt nettverksbrukernavn.
ru: Имя сетевой учетной записи.

# uQI-ol-UUw.title
source: user
hr_ba: Korisnik
nn: bruker

# w1A-iF-wAU.ibShadowedToolTip
source: Sign out of your network account.
hr_ba: Odjavi se od mrežnog korisnika.
nn: Logg ut av din nettverkskonto.
ru: Выйти из сетевой учетной записи.

# w1A-iF-wAU.title
source: Sign Out
hr_ba: Odjava
nn: Logg Ut
ru: Выйти из учетной записи
