{"id":616,"date":"2018-05-31T22:02:23","date_gmt":"2018-06-01T03:02:23","guid":{"rendered":"http:\/\/orchardgrove.wpengine.com\/?page_id=616"},"modified":"2018-05-31T22:11:25","modified_gmt":"2018-06-01T03:11:25","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/nomad.menu\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>[et_pb_section bb_built=&#8221;1&#8243;][et_pb_row][et_pb_column type=&#8221;4_4&#8243;][et_pb_text _builder_version=&#8221;3.1.1&#8243;]<\/p>\n<h1><b>PRIVACY POLICY<\/b><\/h1>\n<p>Orchard &amp; Grove, Inc. (“O&amp;G”) is committed to the privacy of your information. This Privacy Policy is meant to help you understand the information we collect, why we collect it, and how you can manage it. This Policy applies to our website at www.nomad.menu (the “Site”) and any NoMAD-related products, services, communications, or apps (the “Services”). By using our Site, or by purchasing our products and services, you are acknowledging that you have read, understood, and accept this Privacy Policy.<\/p>\n<p>In this Privacy Policy, any use of the words &#8220;you&#8221;, &#8220;yours,&#8221; or similar expressions refers to users of this Site and our Services, as well as any other individuals whose information we collect and process. References to &#8220;we&#8221;, &#8220;us, &#8220;our&#8221; or similar expressions refer to NoMAD.<\/p>\n<p>This Policy does not extend to anyone whose personal information is not under our control or management, including data that is collected by other websites that you may visit before or after this Site, and which are not governed by this Privacy Policy. We are not responsible for the data protection or privacy policies of any other websites, and accept no responsibility or liability for those policies. Please carefully check the policies of other websites and services you use before you visit or submit personal information.<\/p>\n<p>&nbsp;<\/p>\n<h2><b>Information We Collect<\/b><\/h2>\n<p><b><\/b><strong>1.1 Information We Collect and Receive<\/strong><i>.<\/i> In order for you to use our Site and Services, we need to collect and process certain types of information.<span class=\"Apple-converted-space\">  <\/span>Depending on your use of our Site and Services, this may include:<\/p>\n<ul>\n<li>Information you provide to us by completing forms on our website: For example, your name, contact, and address information, and any other information you may provide in the forms on our website;<\/li>\n<li>Information you provide to us by contacting us: Any personal information you may provide to us when you email or call us, such as name, phone number, employer, and any other details you provide in your communications. NoMAD may also request your contact information for the purposes of having someone contact you for additional information, or in response to your request for information from us;<\/li>\n<li>Transaction information when you purchase products or services from us: For example, if you make purchases with your credit card, we use your credit card information for shipping, billing, and credit card validation purposes;<\/li>\n<li>Login information for any hosted O&amp;G services, such as username and password, that you may use in connection with our online services. Note: we don’t ever collect, or even know about, any login information you put into any of the NoMAD applications directly;<\/li>\n<li>Information about your activity in connection with our products and services, including your device information (such as your IP address, the type of device or browser you use, and your actions with respect to our products and services)<\/li>\n<li>Information about the ways people visit and interact with our Site, such as traffic analytics, IP address, geolocation information, and other statistics; and<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Information about your activity on our Sites, including your device information (such as your IP address, the type of device or browser you use, and your actions on the website).<\/li>\n<\/ul>\n<p>We will only use personal information to provide you with information, products, or services you have requested, or for other purposes set out in this Policy. Personal information does not include aggregate information from which individual identities have been removed.<\/p>\n<p><strong>1.2 Information from Children<\/strong>.  O&amp;G does not knowingly solicit or collect any personal information from anyone under 13 years of age, and children under 13 are not permitted to register for or use our Site or Services, include by subscribing to receive information from O&amp;G. Parents can contact our customer service department to access, change, or delete the personal information that has been submitted by a child. If we become aware that a child under the age of 13 has provided us with personal information, we will delete it. <span class=\"Apple-converted-space\"> <\/span><\/p>\n<p><strong>1.3 Cookies and Tracers.<\/strong> We use cookies and similar technologies (e.g., web beacons, pixels, ad tags and device identifiers) to recognize you and\/or your device(s) on, off and across the Site and different Services and devices. You can control cookies through your browser settings and other tools. You can also opt-out from our use of cookies and similar technologies that track your behavior on the sites of others for third party advertising. You can learn more about our use of cookies on our Cookie Policy.<\/p>\n<p>&nbsp;<\/p>\n<h2><b>How We Use Information<\/b><\/h2>\n<p>O&amp;G may use the personal information we collect for the following purposes:<\/p>\n<ul>\n<li>To allow you log into and access O&amp;G online services;<\/li>\n<li>To deliver our products and services;<\/li>\n<li>To provide our support services;<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>To process any financial transactions you make on our Site.<\/li>\n<li>To keep your information secure, and to be able to verify your identity and contact information;<\/li>\n<li>To alert you about product updates, special offers, updated information and other news and services from O&amp;G;<\/li>\n<li>To ensure our website and services are relevant to you and your interests;<\/li>\n<li>To help us create and publish content most relevant to you; and<\/li>\n<li>To contact you in response to sign up forms or requests such as our Feedback or Contact Us forms.<\/li>\n<\/ul>\n<h2><b><\/b><b>How Information May Be Shared<\/b><\/h2>\n<p>O&amp;G will not sell or rent any of your personal information, and we will never share your personal information publicly. However, we may share your information with certain trusted third-party services to help us provide, improve, promote, or protect our products and Services. For example, we may partner with other companies to process your payments or store your data to support delivery of our products or services. Whenever we share data with third-party services, we require that they use your information only for the purposes we’ve authorized, and that they protect your personal information at least to the same standards we do.<\/p>\n<p>We also reserve the right to disclose personal information for the following limited purposes:<\/p>\n<ol>\n<li><b>Business Transfers.<\/b>  As O&amp;G continues to develop its business, we might sell or buy subsidiaries or business units. In such transactions, customer information generally is one of the transferred business assets but remains subject to the obligations made in any pre-existing privacy policy.<\/li>\n<li><b>Legal Obligations<\/b>. O&amp;G may share your personal information if we have a good faith belief that such action is necessary to:  (i) comply with legal process or other legal requirements of any governmental authority; (ii) protect and defend the rights or property of O&amp;G; (iii) enforce this Privacy Policy or the Website Terms and Conditions of Access and Use Agreement; (iv) protect the interests of other users of the Site or any other person; or (v) operate or conduct maintenance and repair of the Site or equipment.<\/li>\n<\/ol>\n<p>Otherwise, your personal information is never shared with any individual or other organization.<\/p>\n<ol start=\"4\">\n<li><b><\/b><b>Protection of your Personal Information<\/b><\/li>\n<\/ol>\n<p>We take the security of your personal information seriously, and follow industry-standard practices to protect the data we collect and process. For the most part we collect as little information as possible in order to provide goods and services to you and we make every attempt to safeguard the information that we do need. O&amp;G has put in place commercially reasonable physical, electronic, and managerial procedures to safeguard and secure the personal information that O&amp;G collects. Access to personal information will be restricted to our authorized personnel who require the information in order to perform their duties properly. In addition, access will be limited to only that information that is strictly necessary for the performance of those duties.<\/p>\n<p>Remember, the safety and security of your information also depends on you. Where you have chosen or we have given you a user name and password for access to certain parts of the Site or Services, you are responsible for keeping the user name and password confidential. No method of transmission over the internet or electronic storage is completely secure, so O&amp;G cannot guarantee its absolute security.<\/p>\n<ol start=\"5\">\n<li><b><\/b><b>Data Transfers<\/b><\/li>\n<\/ol>\n<p>Because O&amp;G is a US-based company, your information may be collected and processed in the United States. Additionally, as part of the products and services offered to you through our Site, the information which we collect about you may be transferred to, and stored in, one or more countries other than where you currently reside. For example, this may occur if any of our servers or third-party service providers are located in a country other than yours. These countries may have different data protection laws that are similar to your current residence. However, if we transfer your information in this way, we will put in place appropriate protection to make sure your personal data remains adequately protected and is treated in line with this Privacy Policy.<\/p>\n<ol start=\"6\">\n<li><b><\/b><b>European Union Residents<\/b><\/li>\n<\/ol>\n<p>Data protection law in Europe requires a “lawful basis” for collecting and retaining personal information from residents of the European Economic Area. Our lawful bases include:<\/p>\n<ul>\n<li>Performing the contract we have with you: In certain circumstances, we need your personal data to comply with our contractual obligation to deliver our goods and services, and assist with any questions you may have.<\/li>\n<li>Consent: we may ask your consent to process your personal information in some situations.<\/li>\n<li>Legal compliance: Sometimes the law says we need to collect and use your data.<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Legitimate interests: This is a term in data protection law that allows us to process your personal information if we have a fair reason to use your data, and only if we do so in ways which do not hurt your interests and rights. We sometimes require your data to pursue our legitimate interests in running our business, including for delivering our products and services, fraud prevention, quality assurance, and marketing purposes, as long as our use of your data does not materially impact your rights, freedom or interests. This allows us to improve and develop the quality of the online experience we offer all our users.<\/li>\n<\/ul>\n<ol start=\"7\">\n<li><b><\/b><b>Email Notifications<\/b><\/li>\n<\/ol>\n<p>We try to keep email communications to a minimum, and give you the ability to opt in to any marketing communications we send. For example, we may send you email relating to the goods or services we provide. You may also elect to receive certain marketing email communications, in accordance with your preferences, and from which you may opt out at any time.<span class=\"Apple-converted-space\">  <\/span>You can always opt out of receiving email information or mobile device notifications from NoMAD other than communications informing you of the completion of a purchase, user registration, correction of user data, or change of password, by logging into the Site and adjusting your user preferences in your account profile, or by sending us an email at privacy@nomad.menu stating your request. If we have sent you a promotional email or mobile device notification, you may send us a return email or mobile device communication asking to be omitted from future email or mobile device distributions. This opt out does not apply to information provided to NoMAD as a result of a product purchase, product service experience, or other transactions.<\/p>\n<ol start=\"8\">\n<li><b><\/b><b>Retention<\/b><\/li>\n<\/ol>\n<p>We will hold your personal information on our systems for as long as is necessary to perform the relevant processing activity for that information, or as long as is set out in any relevant contract you hold with us. This is a case by case determination that depends on things like the nature of the data, why it is collected, why it is processed, and any relevant legal or operational retention needs. For example, we may retain your data for as long as you maintain an account on our Site so that we may process and deliver your orders. We may also be legally required to hold some types of information to fulfill our statutory obligations. We review our retention periods for personal information on a regular basis. When the relevant processing activity has been completed, we may destroy your data, or alternatively anonymize the data in such a way that you are not personally identifiable, either directly or indirectly.<\/p>\n<ol start=\"9\">\n<li><b><\/b><b>Control of your Information<\/b><\/li>\n<\/ol>\n<p>Users or website visitors residing in certain countries, such as the EU, are afforded certain rights regarding their personal information. Except where an exception or exemption applies, these rights may include the ability to access, correct, and\/or request deletion of your personal information. While these rights are not globally applicable, our customers are entitled to access the personal information that we hold about them. You can review the personal data you have provided for any of our hosted O&amp;G services by accessing your account profile on our Site.<span class=\"Apple-converted-space\">  <\/span>To ensure that your personal information is accurate, complete, and up to date, by updating your account profile on our Site, or by contacting us through the email address below regarding any errors or updates affecting the personal information that we may hold. To delete the personal information you’ve provided to us, please log into your account and delete your account from the account settings page.<\/p>\n<p>You may also send us an email at <a href=\"mailto:support@ergodyne.com\">privacy@nomad.menu<\/a> to request access to, correct, or delete any personal information that we hold about you. To protect your privacy and security, NoMAD may take reasonable steps to verify your identity before granting access to, correcting, or deleting data. We will generally respond to your request for information within thirty days, unless, for reasons beyond our control, a longer response time is necessary, in which case, you will be advised accordingly. Please note that we may retain certain information as required by law or as necessary for our legitimate business purposes.<\/p>\n<ol start=\"10\">\n<li><b> 10.<\/b><b>Questions, Comments, or Complaints<\/b><\/li>\n<\/ol>\n<p>If you have questions or comments about this Privacy Policy, or if you are not completely satisfied with this Privacy Policy or its application by us, we invite you to convey your concerns or suggestions to us at <a href=\"mailto:sales@nomad.menu\">privacy@nomad.menu<\/a>. We will reply as quickly as possible and inform you of the steps, if any, that have been or will be taken in order to address your concern or implement the suggestion.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>NoMAD strives to satisfy our customers’ and visitors’ privacy concerns. However, if you have contacted NoMAD about your issue and are still unhappy with our response, and if you are also a resident of the European Economic Area, subject to applicable law, you may also have the right to object to NoMAD’s use of your personal information, and to lodge a complaint with your local data protection authority. More information is available <a href=\"http:\/\/ec.europa.eu\/newsroom\/article29\/item-detail.cfm?item_id=612080\">here<\/a>.<\/p>\n<ol start=\"11\">\n<li><b> 11.<\/b><b>Updates and Changes to this Privacy Policy<\/b><\/li>\n<\/ol>\n<p>This Privacy Policy is effective from May 25, 2018. We may update this Policy from time to time. If we do, we’ll let you know about any material changes, either by notifying you on the Site or by sending you an email. Any updates to this Policy will not apply retroactively. If you keep using our Site or Services after a change, that means you accept this Policy.<\/p>\n<p>15516353v1<\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[et_pb_section bb_built=&#8221;1&#8243;][et_pb_row][et_pb_column type=&#8221;4_4&#8243;][et_pb_text _builder_version=&#8221;3.1.1&#8243;] PRIVACY POLICY Orchard &amp; Grove, Inc. (“O&amp;G”) is committed to the privacy of your information. This Privacy Policy is meant to help you understand the information we collect, why we collect it, and how you can manage it. This Policy applies to our website at www.nomad.menu (the “Site”) and any NoMAD-related products, [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/pages\/616"}],"collection":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/comments?post=616"}],"version-history":[{"count":0,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/pages\/616\/revisions"}],"wp:attachment":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/media?parent=616"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}