{"id":382,"date":"2017-11-09T15:07:50","date_gmt":"2017-11-09T15:07:50","guid":{"rendered":"https:\/\/nomad.menu\/?post_type=kbe_knowledgebase&#038;p=382"},"modified":"2018-06-20T10:27:34","modified_gmt":"2018-06-20T15:27:34","slug":"certificates","status":"publish","type":"kbe_knowledgebase","link":"https:\/\/nomad.menu\/help\/certificates\/","title":{"rendered":"Certificates"},"content":{"rendered":"<h2><strong>NoMAD and Certificates from Active Directory<\/strong><\/h2>\n<p>NoMAD can use a user&#8217;s Kerberos ticket to connect to a Windows Web Certificate Authority and obtain a certificate for that user. This method works well, but does come with a few caveats that you should keep in mind:<\/p>\n<ol>\n<li>If you&#8217;re bound to AD, you&#8217;re probably better off using a profile via MDM or other management tool to get a user and\/or machine certificate. Apple has put a lot of work into making this pretty seamless. The primary use of NoMAD in this case is for unbound machines, although the process will work well either way.<\/li>\n<li>NoMAD can only get a user certificate. Since NoMAD runs in user space, it has no access to any machine account credentials. Also, if you&#8217;re not bound to AD, you most likely don&#8217;t even have a machine account in AD in the first place.<\/li>\n<li>This method requires a Windows CA to have web enrollment turned on. This is a standard feature of Windows Server, but it&#8217;s not always turned on. The web enrollment also needs to be set to allow for either Kerberos authentication or Windows Authentication in Windows parlance.<\/li>\n<\/ol>\n<h2><strong>Set Up<\/strong><\/h2>\n<p>To have NoMAD get a certificate, you need to set the DNS name of the Web CA and the Certificate Template to use in NoMAD&#8217;s preferences. The DNS name is just the name; do not include http\/https or any trailing path, e.g. <code>dc1.nomad.test<\/code>, not <code>https:\/\/dc1.nomad.test\/certsrv<\/code>.<\/p>\n<p>With these two options set, a new &#8220;Get Certificate&#8221; menu will show in the NoMAD menu, if a user is signed into AD. Selecting this item will cause a CSR to be generated locally and sent to the Web CA. Assuming that everything is in order, the CA will sign the CSR and send that back to the Mac. NoMAD will then add the signed certificate to the private key in the user&#8217;s keychain.<\/p>\n<h2><strong>Additional Options<\/strong><\/h2>\n<p>Check our page on <a href=\"https:\/\/nomad.menu\/help-center\/preferences-and-what-they-do\/\">Preferences<\/a> for more information on how to automatically get a certificate, how to automatically renew a certificate, and how to ensure that the private key is set as non-exportable.<\/p>\n<h2><strong>Troubleshooting<\/strong><\/h2>\n<p>The simplest way to test this is to go to the Web CA using a web browser on the Mac. Safari is typically the easiest, as it requires no configuration to use Kerberos. With the DNS name of the CA, add <code>\/certsrv<\/code> to get to the web enrollment page. You can then request a certificate using a certificate template through the web interface.<\/p>\n<p>Some items of note here:<\/p>\n<ol>\n<li>The Mac needs to have full trust of the SSL certificates used on the Web CA for NoMAD to work. If your web browser tells you the connection is untrusted, you&#8217;ll need to ensure the certificates are fully trusted.<\/li>\n<li>If the web CA prompts for authentication and you already have Kerberos tickets for the user, the Web CA needs to be using Windows Authentication. This can be changed using the IIS tools on the Windows server.<\/li>\n<li>The certificate template to be used has to be available to the user that is requesting the certificate. This can be configured in the certificate template snap-in that&#8217;s part of the MMC on the Windows server.<\/li>\n<li>If the Web CA&#8217;s certs are trusted but the certificate pull still doesn&#8217;t work, use <code>nscurl --ats-diagnostics --verbose https:\/\/server.domain.com<\/code> from the CLI on the Mac with your Web CA&#8217;s DNS name substituted in. This will determine whether the TLS security on the Web CA is on par with what macOS is expecting. Often, the Web CA may be set up with TLS 1.0 or other older protocols. You&#8217;ll need to be on TLS 1.2 for NoMAD to use the Web CA.<\/li>\n<li>Finally, look at the CA on the Windows server and look for failed certificate requests. Other common issues can be discovered here, such as missing a set email for the user, or other configuration problems.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>NoMAD and Certificates from Active Directory NoMAD can use a user&#8217;s Kerberos ticket to connect to a Windows Web Certificate Authority and obtain a certificate for that user. This method works well, but does come with a few caveats that you should keep in mind: If you&#8217;re bound to AD, you&#8217;re probably better off using [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","template":"","kbe_taxonomy":[25],"kbe_tags":[],"_links":{"self":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/382"}],"collection":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase"}],"about":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/types\/kbe_knowledgebase"}],"author":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/comments?post=382"}],"version-history":[{"count":0,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/382\/revisions"}],"wp:attachment":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/media?parent=382"}],"wp:term":[{"taxonomy":"kbe_taxonomy","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_taxonomy?post=382"},{"taxonomy":"kbe_tags","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_tags?post=382"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}