{"id":387,"date":"2017-12-19T21:22:43","date_gmt":"2017-12-19T21:22:43","guid":{"rendered":"https:\/\/nomad.menu\/?post_type=kbe_knowledgebase&#038;p=387"},"modified":"2018-06-20T10:42:51","modified_gmt":"2018-06-20T15:42:51","slug":"unannounced-password-change-alerts","status":"publish","type":"kbe_knowledgebase","link":"https:\/\/nomad.menu\/help\/unannounced-password-change-alerts\/","title":{"rendered":"Unannounced Password Change Alerts"},"content":{"rendered":"<p>Unannounced Password Change Alerts, or UPCs for short, occur when a password was changed outside of NoMAD, perhaps on another machine, or through Active Directory Users and Groups by an IT staff member. When using the built-in AD plugin on the Mac with bound user accounts, this can be a situation ripe for annoyance at best, or disaster at worst, as macOS will sync the user account, but not always FileVault, and never the user&#8217;s Keychain password.<\/p>\n<h2><strong>How NoMAD Deals with UPCs<\/strong><\/h2>\n<p>If the <code>UPCAlert<\/code> key is set in the NoMAD preferences, NoMAD compares the last known password set date against the password set date in the user&#8217;s AD record. This happens every 15 minutes, on every network change, or whenever the user clicks on the NoMAD menu.<\/p>\n<p>If a discrepancy between these dates is found, NoMAD shows a notification in the macOS Notification Center to alert the user that his or her password was changed in AD outside of NoMAD on that machine. By selecting that notification, the user is given the opportunity to sign in to NoMAD again in order to validate their new password. At that point, NoMAD will use the user&#8217;s old password in the Keychain to update the Keychain with the new password, as on AD-bound machines, the user password should already have been updated.<\/p>\n<h2><strong>Important Considerations<\/strong><\/h2>\n<p>For this to work, the user must be storing their password in the Keychain (the <code>UseKeychain<\/code> setting in the NoMAD preferences). NoMAD must also be up and running on a computer when the notification is sent. If the user is signed out of his or her Mac when this happens, NoMAD is unable to do anything to fix it. In addition, the Mac needs to be on the AD domain for the alert to be triggered.<\/p>\n<p>The <code>UPCAlert<\/code> state is a unique situation for NoMAD, because on AD-bound machines the user password will be automatically updated by the act of checking the password, so checking the user password is not enough to determine that the user is in this state.<\/p>\n<h2><strong>Other Notes<\/strong><\/h2>\n<p>NoMAD has the option of triggering an action to be done at the time of a <code>UPCAlert<\/code>. This is set with the <code>UPCAlertAction<\/code> preference key.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Unannounced Password Change Alerts, or UPCs for short, occur when a password was changed outside of NoMAD, perhaps on another machine, or through Active Directory Users and Groups by an IT staff member. When using the built-in AD plugin on the Mac with bound user accounts, this can be a situation ripe for annoyance at [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"closed","template":"","kbe_taxonomy":[25],"kbe_tags":[],"_links":{"self":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/387"}],"collection":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase"}],"about":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/types\/kbe_knowledgebase"}],"author":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/comments?post=387"}],"version-history":[{"count":0,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/387\/revisions"}],"wp:attachment":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/media?parent=387"}],"wp:term":[{"taxonomy":"kbe_taxonomy","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_taxonomy?post=387"},{"taxonomy":"kbe_tags","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_tags?post=387"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}