{"id":505,"date":"2016-12-21T01:52:33","date_gmt":"2016-12-21T01:52:33","guid":{"rendered":"http:\/\/gonomad.wpengine.com\/?post_type=kbe_knowledgebase&#038;p=130"},"modified":"2018-06-19T09:43:21","modified_gmt":"2018-06-19T14:43:21","slug":"130","status":"publish","type":"kbe_knowledgebase","link":"https:\/\/nomad.menu\/help\/130\/","title":{"rendered":"Overview"},"content":{"rendered":"<p dir=\"auto\">NoMAD is designed to relieve your users of the burden of being bound to a directory service, Active Directory, while providing those users with all of the advantages of being bound and more. While NoMAD was not originally intended for use in an environment where the client machines are bound, there are valid use cases for NoMAD in these environments as well.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">First and foremost, NoMAD is a password management tool allowing users to integrate into a Kerberos single sign on environment, keep track of when their directory password expires, and then allow the user to change it. From this foundation, NoMAD can leverage the single sign on environment to provide a number of other functions that use the user&#8217;s Kerberos ticket and NoMAD&#8217;s knowledge about their network account.<\/p>\n<h2 dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\"><strong style=\"font-size: 20px; line-height: 1.6em;\">Basic Operation<\/strong><\/h2>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">On launch, NoMAD looks to see if an AD domain has been set in the NoMAD preferences; if this has not been set, the user will be prompted to configure the domain. NoMAD then uses that domain to query DNS for SRV records related to that domain. You can simulate this with <code>dig -t SRV _ldap._tcp.nomad.test<\/code> replacing &#8220;nomad.test&#8221; with your AD domain. NoMAD uses the built-in DNS resolver APIs and not the POSIX APIs used by dig, nslookup, and other tools. This ensures that NoMAD can operate with SSL VPNs and other more complicated network setups requiring the user of the built-in DNS resolver.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">If NoMAD can resolve the SRV records, it changes its state to &#8220;connected&#8221; and allows the user to sign in to the domain. The sign in process is handled by the system&#8217;s Kerberos APIs, which will do a DNS lookup for _kdc._tcp. records and then use those KDCs to authenticate the user.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">Upon a successful login, NoMAD will change to a &#8220;logged in&#8221; state and offer further functionality to the user, since the user has now been authenticated into a single sign on environment. Once logged in, NoMAD will pull the user&#8217;s record from AD using a Kerberos-authenticated LDAP connection. NoMAD then calculates the user&#8217;s password expiration times, home share, display name, and other attributes from the user record.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">NoMAD will re-check its environment on three conditions:<\/p>\n<ul dir=\"auto\">\n<li>Every 15 minutes.<\/li>\n<li>Each time the menu item is clicked. (Note that much of NoMAD&#8217;s directory lookups and other activities happen in the background, so clicking the menu starts off the lookup process but any changes may not be immediately displayed.)<\/li>\n<li>Whenever a network interface changes.<\/li>\n<\/ul>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">NoMAD does throttle its lookups in order to reduce as much unnecessary network traffic as possible. Additionally, the network lookups that NoMAD does are fairly lightweight and mostly limited to DNS SRV record lookups and pulling the user&#8217;s account information over LDAP.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">Upon sign out, NoMAD will remove the users Kerberos tickets using <code>kdestroy<\/code> and return to a &#8220;connected&#8221; state.<\/p>\n<h2 dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\"><strong style=\"font-size: 20px; line-height: 1.6em;\">AD Sites<\/strong><\/h2>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">NoMAD is site-aware and uses domain controllers (DCs) within the site for all operations. On an initial sign in, NoMAD looks up the DCs using just the AD domain. It then iterates through the list of returned DCs, querying them with LDAP pings. When a DC replies, it informs NoMAD of what site it should be using and supplies other telemetry about the domain. If the replying DC is not part of the site NoMAD should be using, NoMAD will run a DNS query for the site-specific DCs it should be using. NoMAD will iterate through the list of DCs for the site it should be a part of again, and check them all for connectivity. Once it has successfully found a working DC, it will maintain that DC until a network change occurs and the process starts all over again.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">Since NoMAD is not using its own Kerberos library, and Kerberos on its own is not site-aware, there&#8217;s a chance that the client system may be using different DCs for LDAP and Kerberos. This will not present a problem for most operations, as each system is used for different purposes. This is especially true because once a user has been authenticated, NoMAD has no need to query the Kerberos KDC until the Kerberos ticket needs to be renewed.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">When a user changes their password, however, it&#8217;s important that the operation happens on the same DC that NoMAD is using for LDAP queries as it is for the kpasswd operation. Otherwise, in situations where replication between DCs may not be instantaneous, there may be a discrepancy between the password expiration that NoMAD shows and the new expiration date.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">When changing passwords, NoMAD attempts to create a com.apple.Kerberos.plist specifying the DC currently in use by NoMAD for LDAP queries. The system Kerberos APIs then uses this DC for changing the password via Kerberos. NoMAD removes this file after the password has been changed, to avoid impeding future Kerberos operations.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">Note that you can prevent site lookups by specifying a list of specific DCs you&#8217;d like to use. This is done via the <code>LDAPServerList<\/code> preference key. Keep in mind that by doing this, NoMAD will only use those DCs and will not fall back to any others.<\/p>\n<h2 dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\"><strong style=\"font-size: 20px; line-height: 1.6em;\">Password Expiration Calculations<\/strong><\/h2>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">Where possible, NoMAD uses <code>msDS-UserPasswordExpiryTimeComputed<\/code>, which, similar to the LDAP ping, has the DC compute the user&#8217;s password expiration time and then tell NoMAD. This method supports fine-grained password policies; however, it&#8217;s only available in Windows 2008 domains and higher. On older domains, NoMAD will fall back to looking up the global password expiration policy and then computing the user&#8217;s last password set date against that global policy. NoMAD is aware of user&#8217;s that have been exempted from password expirations and will display that information accordingly.<\/p>\n<p dir=\"auto\" style=\"font-size: 16px; line-height: 1.75em;\">The default setting for expiration notifications starts at 15 days out. This can be configured with the <code>PasswordExpireAlertTime<\/code> key in the NoMAD preferences. Once the initial threshold has been crossed, NoMAD will alert the user based on the time to expiration:<\/p>\n<ul dir=\"auto\">\n<li>Between the threshold and 4 days &#8211; NoMAD will alert once a day<\/li>\n<li>Between 4 days and 1 day &#8211; NoMAD will alert twice per day<\/li>\n<li>Less than 1 day &#8211; NoMAD will alert every hour<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>NoMAD is designed to relieve your users of the burden of being bound to a directory service, Active Directory, while providing those users with all of the advantages of being bound and more. While NoMAD was not originally intended for use in an environment where the client machines are bound, there are valid use cases [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"open","ping_status":"closed","template":"","kbe_taxonomy":[20],"kbe_tags":[],"_links":{"self":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/505"}],"collection":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase"}],"about":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/types\/kbe_knowledgebase"}],"author":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/comments?post=505"}],"version-history":[{"count":0,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/505\/revisions"}],"wp:attachment":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/media?parent=505"}],"wp:term":[{"taxonomy":"kbe_taxonomy","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_taxonomy?post=505"},{"taxonomy":"kbe_tags","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_tags?post=505"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}