{"id":655,"date":"2018-06-18T16:16:20","date_gmt":"2018-06-18T21:16:20","guid":{"rendered":"https:\/\/nomad.menu\/?post_type=kbe_knowledgebase&#038;p=655"},"modified":"2018-07-13T11:03:45","modified_gmt":"2018-07-13T16:03:45","slug":"nomad-testing-guide","status":"publish","type":"kbe_knowledgebase","link":"https:\/\/nomad.menu\/help\/nomad-testing-guide\/","title":{"rendered":"NoMAD Testing Guide"},"content":{"rendered":"<p>This guide serves as a checklist for evaluating NoMAD in your environment. It should also give you some ideas about NoMAD deployment and usability scenarios as well.<\/p>\n<h2><strong>Basic Functionality<\/strong><\/h2>\n<p>Start at the beginning by downloading a fresh copy of NoMAD on a fresh Mac. It doesn&#8217;t matter if the Mac is bound to AD or not; NoMAD will work either way.<\/p>\n<p>You can find the download here, in the <a href=\"https:\/\/nomad.menu\/support\/\">Support<\/a> section of the website.<\/p>\n<ol>\n<li>Launch NoMAD. The binary is signed, as all good applications should be, and can be run from any location. The application&#8217;s icon is a caribou, the most nomadic land mammal in the world.<img loading=\"lazy\" class=\"aligncenter wp-image-99 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2016\/12\/404.png\" alt=\"404\" width=\"524\" height=\"251\" \/><\/li>\n<li>If you&#8217;re not bound to AD, you&#8217;ll be presented with a Preferences window. The only field you need to fill out at this time is the &#8220;AD Domain&#8221; field at the top.<img loading=\"lazy\" class=\"aligncenter wp-image-180 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-9.40.31-PM.png\" alt=\"Screen Shot 2017-01-30 at 9.40.31 PM\" width=\"1008\" height=\"670\" \/><\/li>\n<li>If you are bound to AD, you will not see the Preferences window, as NoMAD will automatically determine your AD Domain and use that. You can change this later by using the Preferences window, or through other means.<\/li>\n<li>Once NoMAD has launched, you&#8217;ll see a triangle icon in the Menu Bar at the top of your screen. If you are not able to reach your AD Domain, you&#8217;ll see &#8220;Not Connected&#8221; next to the icon. If you can reach your domain, you&#8217;ll see the same triangle without any text. Finally, if you already have a Kerberos ticket for the current user, you will see a green check mark in the triangle. The icons are shown below.<img loading=\"lazy\" class=\"aligncenter wp-image-181 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/32x32.png\" alt=\"32x32\" width=\"32\" height=\"32\" \/><img loading=\"lazy\" class=\"aligncenter wp-image-183 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/32x32-1.png\" alt=\"32x32\" width=\"32\" height=\"32\" \/><\/li>\n<li>If the icon has &#8220;Not Connected&#8221; next to it, sign in to your VPN or otherwise connect to your organization&#8217;s network so that your AD Domain Controllers (DCs) are able to be reached by the system running NoMAD. NoMAD will automatically detect when the network has changed and will update accordingly.<\/li>\n<li>Once connected, you can sign in to NoMAD if you do not have a green check mark in the NoMAD icon in the menu bar. Do this by using the &#8220;Sign In&#8221; option on the menu. If you&#8217;re unable to contact the DCs, you won&#8217;t be able to use the &#8220;Sign In&#8221; menu item.<\/li>\n<li>This will activate the Sign In window where you can sign in as an AD user. You can simply use the user&#8217;s short name, or you can use their full user@domain.com handle. Note that there is no need to enter the NT Domain before the user name.<img loading=\"lazy\" class=\"aligncenter wp-image-185 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-9.55.33-PM.png\" alt=\"Screen Shot 2017-01-30 at 9.55.33 PM\" width=\"986\" height=\"496\" \/><\/li>\n<li>Upon successful authentication, you will now have a Kerberos TGT for that AD user and will be able to sign in to all Windows SSO resources, which may include websites, file servers, and some applications.<\/li>\n<li>If your user has a password expiration policy, the number of days until that user&#8217;s password expires will be shown on the menu bar next to the NoMAD icon and on the second line of the NoMAD menu itself. If the user does not have an expiration date, then no text will be next to the NoMAD icon and the second line of the NoMAD menu will show &#8220;password does not expire&#8221;.<img loading=\"lazy\" class=\"aligncenter wp-image-186 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.03.29-PM.png\" alt=\"Screen Shot 2017-01-30 at 10.03.29 PM\" width=\"504\" height=\"536\" \/><\/li>\n<li>To remove your SSO credentials, you can use the &#8220;Sign Out&#8221; menu item.<\/li>\n<\/ol>\n<h2><strong>User Interaction<\/strong><\/h2>\n<p>Next, you&#8217;ll want to test additional user functionality beyond a simple sign in and sign out. To do that, we&#8217;ll walk through the rest of the menu items. To begin, sign in to AD with NoMAD so that you have a valid user already logged in. Your NoMAD menu should look similar to this:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-186 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.03.29-PM.png\" alt=\"Screen Shot 2017-01-30 at 10.03.29 PM\" width=\"504\" height=\"536\" \/><\/p>\n<ol>\n<li>If the currently signed in user has a password expiration date, hovering your mouse over the NoMAD icon in the menu bar will show you the actual date and time that their password expires.<\/li>\n<li>Holding down the &#8220;option&#8221; key while clicking on the NoMAD menu will show the expiration date of your current Kerberos TGT, and the AD Domain Controller that NoMAD is currently using for all LDAP lookups in the second item on the NoMAD menu.<\/li>\n<li>Test renewing your Kerberos ticket by using the &#8220;Renew Tickets&#8221; menu item. This will renew the ticket with AD and ensure that your Kerberos ticket has the longest duration possible. You can verify this by using the <code>klist<\/code> tool on the command line, or by holding down the &#8220;option&#8221; key again to view the ticket lifetime in the second line of the NoMAD menu. It may take a few seconds for the lifetime to update in the menu.<\/li>\n<li>Next, change the user&#8217;s password by using the &#8220;Change Password&#8221; menu item. This will bring up the &#8220;Change Password&#8221; window and allow you to enter your old password and then the new password twice. When you click the &#8220;Change Password&#8221; button, NoMAD will change the user&#8217;s AD password via Kerberos. <img loading=\"lazy\" class=\"aligncenter wp-image-189 size-full\" src=\"http:\/\/orchardgrove.wpengine.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.26.33-PM.png\" alt=\"Screen Shot 2017-01-30 at 10.26.33 PM\" width=\"986\" height=\"578\" \/><\/li>\n<li>If no errors occur, the user&#8217;s AD password will be changed and any password expiration dates will be updated. Note that most AD environments will only allow a password to be changed once every 24 hours. Also note that this will not change the password of the local user account on the Mac by default; that can be enabled using a preference key if desired.<\/li>\n<li>Next, use the &#8220;Lock Screen&#8221; button to sleep the Mac&#8217;s screen. If you have the system configured to require password when waking the screen, you will be prompted to enter it.<\/li>\n<li>If you have <strong>a)<\/strong> Jamf Self Service,<strong> b)<\/strong> Munki Managed Software Center, or <strong>c)<\/strong> Lan Rev Agent installed on your system, the &#8220;Get Software&#8221; menu item will be available and will launch the appropriate self service application when clicked. If you don&#8217;t have any of those applications, this menu item will not appear; you can specify a different application to be launched from this menu by setting a preference key.<\/li>\n<li>Next, use the &#8220;Get Help&#8221; menu item. This will open a web browser to http:\/\/www.apple.com\/support by default. However, similar to many other menu items in NoMAD, you can set this to an application, a script, another webpage, or even a Bomgar remote support session via the preference keys.<\/li>\n<li>Next, select the &#8220;Preferences&#8221; menu item. You will find the most commonly used options here, as well as the only options that are accessible through the UI. The AD Domain will already be set, and the Kerberos Realm will most commonly be set to the uppercase version of the AD Domain. NoMAD will automatically fill this in if you haven&#8217;t. The next two text fields are for specifying a Windows Certificate Authority and Certificate template for getting certificates from AD. The &#8220;Use Keychain&#8221; check box allows NoMAD to store your AD password in your keychain and automatically log you in. The &#8220;Renew Ticket&#8221; check box determines whether or not NoMAD automatically renews your Kerberos tickets. The text field next to this box allows a user to set how many seconds between renewing the Kerberos ticket. Finally, the &#8220;Show Home Folder&#8221; has NoMAD show a user&#8217;s home folder, as specified in their AD profile, in the menu.<\/li>\n<li>The &#8220;Quit&#8221; menu item will quit NoMAD while keeping any Kerberos tickets intact on your system.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>This guide serves as a checklist for evaluating NoMAD in your environment. It should also give you some ideas about NoMAD deployment and usability scenarios as well. Basic Functionality Start at the beginning by downloading a fresh copy of NoMAD on a fresh Mac. It doesn&#8217;t matter if the Mac is bound to AD or [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"closed","ping_status":"closed","template":"","kbe_taxonomy":[22],"kbe_tags":[],"_links":{"self":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/655"}],"collection":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase"}],"about":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/types\/kbe_knowledgebase"}],"author":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/comments?post=655"}],"version-history":[{"count":0,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_knowledgebase\/655\/revisions"}],"wp:attachment":[{"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/media?parent=655"}],"wp:term":[{"taxonomy":"kbe_taxonomy","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_taxonomy?post=655"},{"taxonomy":"kbe_tags","embeddable":true,"href":"https:\/\/nomad.menu\/wp-json\/wp\/v2\/kbe_tags?post=655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}